In [83]:
%pip install pandas -q
import pandas as pd

Note: you may need to restart the kernel to use updated packages.

## Q - You are given a store inventory dataset with the following columns:
- product_id: Unique identifier for the product
- product_name: Name of the product
- stock_quantity: Quantity of the product currently in stock
- restock_date: Date the product is due to be restocked
- price: Price of the product

In [84]:
df = pd.DataFrame({
    'product_id': [101, 102, 103, 104, 105],
    'product_name': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Printer'],
    'stock_quantity': [10, 50, 20, 0, 5],
    'restock_date': ['2023-10-01', '2023-10-05', '2023-10-03', '2023-10-07', '2023-10-02'],
    'price': [1000.00, 25.00, 45.00, 150.00, 200.00]
})
df

   product_id product_name  stock_quantity restock_date   price
0         101       Laptop              10   2023-10-01  1000.0
1         102        Mouse              50   2023-10-05    25.0
2         103     Keyboard              20   2023-10-03    45.0
3         104      Monitor               0   2023-10-07   150.0
4         105      Printer               5   2023-10-02   200.0

### Find the products that need restocking, i.e., stock quantity is less than 10.

In [85]:
df[df['stock_quantity'] > 10]

   product_id product_name  stock_quantity restock_date  price
1         102        Mouse              50   2023-10-05   25.0
2         103     Keyboard              20   2023-10-03   45.0

### Find the total value of inventory (stock quantity price).

In [86]:
(df['stock_quantity'] * df['price']).sum().item()

13150.0

### Identify the top 3 products with the highest stock value.

In [87]:
(df['stock_quantity'] * df['price']).sort_values(ascending=False).head(3)

0    10000.0
1     1250.0
4     1000.0
dtype: float64

## Q - You are working with a retail business and have customer purchase data with the following columns:
- customer_id: Unique identifier for each customer
- purchase_date: Date of the purchase
- purchase_amount: The amount spent by the customer during a purchase

In [88]:
df = pd.DataFrame({
    'customer_id': [1, 2, 3, 1, 1],
    'purchase_date': ['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04', '2023-10-05'],
    'purchase_amount': [100.00, 200.00, 150.00, 300.00, 250.00]
})
df

   customer_id purchase_date  purchase_amount
0            1    2023-10-01            100.0
1            2    2023-10-02            200.0
2            3    2023-10-03            150.0
3            1    2023-10-04            300.0
4            1    2023-10-05            250.0

### Calculate the total purchase amount for each customer.

In [89]:
df.groupby('customer_id')['purchase_amount'].sum()

customer_id
1    650.0
2    200.0
3    150.0
Name: purchase_amount, dtype: float64

### Calculate the average purchase amount per customer.

In [90]:
df.groupby('customer_id')['purchase_amount'].mean()

customer_id
1    216.666667
2    200.000000
3    150.000000
Name: purchase_amount, dtype: float64

### Determine the customers who have spent the most overtime.

In [91]:
## heen ji??

## In the given DataFrame, calculate the average sales for each product, but only for the 'Home' category.

In [92]:
df = pd.DataFrame({
'Product': ['A', 'B', 'A', 'C', 'B', 'C'],
'Category': ['Electronics', 'Electronics', 'Home', 'Electronics', 'Home', 'Home'],
'Sales': [200, 300, 150, 400, 250, 100]
})
df

  Product     Category  Sales
0       A  Electronics    200
1       B  Electronics    300
2       A         Home    150
3       C  Electronics    400
4       B         Home    250
5       C         Home    100

In [93]:
df[df['Category'] == 'Home'].groupby('Product')['Sales'].mean()

Product
A    150.0
B    250.0
C    100.0
Name: Sales, dtype: float64

## You are tasked with analyzing sales data for an e-commerce company to understand customer behavior, sales trends, and performance. The dataset consists of various attributes related to sales transactions. You need to analyze the data to extract insights like total sales and average order value.

## You’re working with health data from a small clinic

In [94]:
df = pd.DataFrame({
    'PatientID': [1, 2, 3, 4, 5], 
    'Age': [34, 45, 23, 56, 67],
    'Gender': ['F', 'M', 'F', 'M', 'F'], 
    'BloodPressure': [120, 140, 110,160, 130], 
    'Cholesterol': ['Normal', 'High', 'Normal', 'VeryHigh', 'High']
})
df

   PatientID  Age Gender  BloodPressure Cholesterol
0          1   34      F            120      Normal
1          2   45      M            140        High
2          3   23      F            110      Normal
3          4   56      M            160    VeryHigh
4          5   67      F            130        High

### What is the average age of patients?

In [95]:
df['Age'].mean().item()

45.0

### Count the number of patients by gender.

In [96]:
df.groupby('Gender')['PatientID'].count()

Gender
F    3
M    2
Name: PatientID, dtype: int64

### How many patients have “High” or “Very High” cholesterol?

In [97]:
df[df['Cholesterol'].isin(['High', 'VeryHigh'])].groupby('Cholesterol')['PatientID'].count()
## Can be simplified??

Cholesterol
High        2
VeryHigh    1
Name: PatientID, dtype: int64

### List patients with blood pressure over 130.

In [98]:
df[df['BloodPressure'] > 130]

   PatientID  Age Gender  BloodPressure Cholesterol
1          2   45      M            140        High
3          4   56      M            160    VeryHigh

### Replace "Very High" with "Critical" in the cholesterol column.

In [99]:
df['Cholesterol'] = df['Cholesterol'].replace('VeryHigh', 'Critical')
df

   PatientID  Age Gender  BloodPressure Cholesterol
0          1   34      F            120      Normal
1          2   45      M            140        High
2          3   23      F            110      Normal
3          4   56      M            160    Critical
4          5   67      F            130        High

## A company wants to analyze performance data

In [100]:
df = pd.DataFrame({
    'Employee': ['Anna', 'Ben', 'Cara', 'David', 'Eva'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance'],
    'Score_2022': [88, 92, 85, 90, 75], 
    'Score_2023': [91, 89,87, 93, 80]
})
df

  Employee Department  Score_2022  Score_2023
0     Anna         HR          88          91
1      Ben         IT          92          89
2     Cara         IT          85          87
3    David         HR          90          93
4      Eva    Finance          75          80

### Compute the improvement in score for each employee.

In [101]:
df['Improvement'] = df['Score_2023'] - df['Score_2022']
df[['Employee', 'Improvement']]

  Employee  Improvement
0     Anna            3
1      Ben           -3
2     Cara            2
3    David            3
4      Eva            5

### Find the department with the highest average improvement.

In [102]:
df.groupby('Department')['Improvement'].mean()

Department
Finance    5.0
HR         3.0
IT        -0.5
Name: Improvement, dtype: float64

### Who had the highest score in 2023?

In [103]:
df.iloc[df['Score_2023'].argmax(), 0]

'David'

### What is the average score in 2022 and 2023?

In [104]:
df['Score_2022'].mean(), df['Score_2023'].mean()

(np.float64(86.0), np.float64(88.0))

### Add a column with performance grade (A: >90, B: 80-90, C: <80) based on 2023 scores.

In [106]:
def compute_grade(score):
    if score >= 90:
        return 'A'
    elif score >= 80:
        return 'B'
    else:
        return 'C'

df['Performace Grade'] = df['Score_2023'].apply(compute_grade)
df[['Employee', 'Performace Grade']]

  Employee Performace Grade
0     Anna                A
1      Ben                B
2     Cara                B
3    David                A
4      Eva                B

## Rank employees within each department based on their scores (highest first).

In [ ]:
df = pd.DataFrame({
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Cara', 'Dan', 'Eve', 'Frank'],
    'Score': [88, 92, 95, 89, 85, 87]
})
df

  Department Employee  Score
0         HR    Alice     88
1         HR      Bob     92
2         IT     Cara     95
3         IT      Dan     89
4    Finance      Eve     85
5    Finance    Frank     87

In [ ]:
df.groupby('Department')['Score'].max()
## How??

## Given

In [ ]:
df = pd.DataFrame({
    'Customer': ['Alice', 'Bob', 'Alice', 'Dave', 'Bob'],
    'OrderID': [1, 2, 1, 3, 2]
})
df

  Customer  OrderID
0    Alice        1
1      Bob        2
2    Alice        1
3     Dave        3
4      Bob        2

### How many duplicate orders are there?

In [130]:
df[df.duplicated()].ndim

2

### Remove them and keep the first occurrence.

In [126]:
df[~df.duplicated()]

  Customer  OrderID
0    Alice        1
1      Bob        2
3     Dave        3

## Given

In [ ]:
df = pd.DataFrame({
    'Region': ['North', 'South', 'North', 'South'],
    'Product': ['A', 'A', 'B', 'B'],
    'Sales': [200, 150, 100, 250]
})
df

  Region Product  Sales
0  North       A    200
1  South       A    150
2  North       B    100
3  South       B    250

### Pivot the table to show sales per region per product.

### Show only rows where the sales are above the average sales of their region.

In [135]:
avg_sales = df.groupby('Region')['Sales'].mean()
df['Avg_Sales'] = df['Region'].map(avg_sales)
df[df['Sales'] > df['Avg_Sales']]

  Region Product  Sales  Avg_Sales
0  North       A    200      150.0
3  South       B    250      200.0

## How do you get the count of all unique values of a categorical column in a DataFrame?

## Report the top 10 ranked songs by position. Output the track and the ranks in the descending order of ranks. If there are multiple songs with the same rank, sort them in alphabetical order of the track name.